; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=7, locations=10, density=1.0, fully_connected=True, max_capacity=2, out_folder=./full/training, instance_id=42, seed=83

(define (problem transport-42)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l1)
    (at p3 l1)
    (at p4 l4)
    (at p5 l4)
    (at p6 l3)
    (at p7 l5)
    (at v1 l2)
    (at v2 l1)
    (at v3 l7)
    (at v4 l3)
    )
 (:goal  (and 
    (at p1 l6)
    (at p2 l5)
    (at p3 l9)
    (at p4 l8)
    (at p5 l8)
    (at p6 l1)
    (at p7 l1))))

; plan
1. (pick-up v4 l3 p6 c0 c1)
   deleted: (at p6 l3) (capacity v4 c1)
   added: (in p6 v4) (capacity v4 c0)
   goals met: 0 of 7
2. (pick-up v3 l7 p1 c0 c1)
   deleted: (at p1 l7) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 0 of 7
3. (drive v3 l7 l6)
   deleted: (at v3 l7)
   added: (at v3 l6)
   goals met: 0 of 7
4. (drop v3 l6 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l6) (capacity v3 c1)
   goals met: 1 of 7
5. (pick-up v2 l1 p2 c1 c2)
   deleted: (at p2 l1) (capacity v2 c2)
   added: (in p2 v2) (capacity v2 c1)
   goals met: 1 of 7
6. (drive v2 l1 l5)
   deleted: (at v2 l1)
   added: (at v2 l5)
   goals met: 1 of 7
7. (drop v2 l5 p2 c1 c2)
   deleted: (in p2 v2) (capacity v2 c1)
   added: (at p2 l5) (capacity v2 c2)
   goals met: 2 of 7
8. (pick-up v2 l5 p7 c1 c2)
   deleted: (at p7 l5) (capacity v2 c2)
   added: (in p7 v2) (capacity v2 c1)
   goals met: 2 of 7
9. (drive v2 l5 l1)
   deleted: (at v2 l5)
   added: (at v2 l1)
   goals met: 2 of 7
10. (drop v2 l1 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l1) (capacity v2 c2)
   goals met: 3 of 7
11. (drive v2 l1 l4)
   deleted: (at v2 l1)
   added: (at v2 l4)
   goals met: 3 of 7
12. (pick-up v2 l4 p4 c1 c2)
   deleted: (at p4 l4) (capacity v2 c2)
   added: (in p4 v2) (capacity v2 c1)
   goals met: 3 of 7
13. (pick-up v2 l4 p5 c0 c1)
   deleted: (at p5 l4) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 3 of 7
14. (drive v2 l4 l8)
   deleted: (at v2 l4)
   added: (at v2 l8)
   goals met: 3 of 7
15. (drop v2 l8 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l8) (capacity v2 c1)
   goals met: 4 of 7
16. (drop v2 l8 p5 c1 c2)
   deleted: (in p5 v2) (capacity v2 c1)
   added: (at p5 l8) (capacity v2 c2)
   goals met: 5 of 7
17. (drive v4 l3 l1)
   deleted: (at v4 l3)
   added: (at v4 l1)
   goals met: 5 of 7
18. (drop v4 l1 p6 c0 c1)
   deleted: (in p6 v4) (capacity v4 c0)
   added: (at p6 l1) (capacity v4 c1)
   goals met: 6 of 7
19. (pick-up v4 l1 p3 c0 c1)
   deleted: (at p3 l1) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 6 of 7
20. (drive v4 l1 l9)
   deleted: (at v4 l1)
   added: (at v4 l9)
   goals met: 6 of 7
21. (drop v4 l9 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l9) (capacity v4 c1)
   goals met: 7 of 7
